ESP32Async/ESPAsyncWebServer/src/AsyncWebSocket.cpp
// SPDX-License-Identifier: LGPL-3.0-or-later
// Copyright 2016-2026 Hristo Gochkov, Mathieu Carbou, Emil Muratov, Will Miles

#include "AsyncWebSocket.h"
#include "AsyncWebServerLogging.h"

#include <libb64/cencode.h>

#if defined(ESP32)
#if ESP_IDF_VERSION_MAJOR < 5
#include "BackPort_SHA1Builder.h"
#else
#include <SHA1Builder.h>
#endif
#include <rom/ets_sys.h>
#elif defined(TARGET_RP2040) || defined(TARGET_RP2350) || defined(PICO_RP2040) || defined(PICO_RP2350) || defined(ESP8266)
#include <Hash.h>
#elif defined(LIBRETINY)
#include <mbedtls/sha1.h>
#elif defined(HOST)
#include "BackPort_SHA1Builder.h"
#ifndef FPSTR
#define FPSTR (const char *)
#endif
#endif

#include <algorithm>
#include <cstdio>
#include <cstring>
#include <memory>
#include <utility>
#include <cstdarg>

using namespace asyncsrv;

enum class AwsParseState : uint8_t {
  Start = 0,
  Length,
  Length2_1,
  Length2_2,
  Length8_1,
  Length8_2,
  Length8_3,
  Length8_4,
  Length8_5,
  Length8_6,
  Length8_7,
  Length8_8,
  Mask_0,
  Mask_1,
  Mask_2,
  Mask_3,
  Payload,
};

static AsyncWebSocketSharedBuffer makeSharedBuffer(const uint8_t *message, size_t len) {
  if (message) {
    return std::make_shared<std::vector<uint8_t>>(message, message + len);
  } else {
    return std::make_shared<std::vector<uint8_t>>(len);
  }
}

static size_t webSocketSendFrameWindow(AsyncClient *client) {
  if (!client || !client->canSend()) {
    return 0;
  }
  size_t space = client->space();
  if (space < 9) {
    return 0;
  }
  return space - 8;
}

// wire header length for a frame with this payload length/masking -- pure
// function of RFC 6455 framing rules, cheap enough to recompute on demand
// rather than cache
static uint8_t webSocketFrameHeaderLen(size_t payloadLen, bool mask) {
  return 2 + (mask ? 4 : 0) + ((payloadLen > 125) ? 2 : 0);
}

// Stack-allocated chunk size for masking payload data
static constexpr size_t WS_MASK_CHUNK_SIZE = 128;

// Commits any not-yet-committed bytes of one WS frame (header+payload) to
// the client, resuming from `frameSent` bytes already committed by a prior
// call for this exact frame. final/opcode/mask/maskKey/data/len must stay
// identical across calls for the same frame -- once any header byte is
// committed those values are fixed on the wire and can't change. Returns
// the number of *additional* bytes committed by this call (0 if none);
// never assumes an add() fully succeeds, since some AsyncClient backends
// (e.g. SSL) can commit a genuine partial amount.
static size_t
  webSocketAddFrame(AsyncClient *client, bool final, uint8_t opcode, bool mask, const uint8_t maskKey[4], const uint8_t *data, size_t len, size_t frameSent) {
  if (!client || !client->canSend()) {
    return 0;
  }

  size_t committed = 0;

  const uint8_t headLen = webSocketFrameHeaderLen(len, mask);
  if (frameSent < headLen) {
    uint8_t hdr[8] = {0, 0, 0, 0, 0, 0, 0, 0};
    hdr[0] = (opcode & 0x0F) | (final ? 0x80 : 0);
    if (len < 126) {
      hdr[1] = len & 0x7F;
    } else {
      hdr[1] = 126;
      hdr[2] = (uint8_t)((len >> 8) & 0xFF);
      hdr[3] = (uint8_t)(len & 0xFF);
    }
    if (mask) {
      hdr[1] |= 0x80;
      memcpy(hdr + (headLen - 4), maskKey, 4);
    }

    size_t added = client->add((const char *)(hdr + frameSent), headLen - frameSent, ASYNC_WRITE_FLAG_COPY | ((len > 0) ? ASYNC_WRITE_FLAG_MORE : 0));
    committed += added;
    frameSent += added;
    if (frameSent < headLen) {
      return committed;
    }
  }

  size_t payloadSent = frameSent - headLen;
  if (payloadSent < len) {
    size_t remaining = len - payloadSent;
    if (mask) {
      // The data buffer is shared, but each client masks with its own random key.
      // Mask in to a scratch buffer one chunk at a time to avoid malloc overhead.
      uint8_t masked_data[WS_MASK_CHUNK_SIZE];
      while (remaining > 0) {
        const size_t chunk = std::min(remaining, sizeof(masked_data));
        for (size_t i = 0; i < chunk; i++) {
          masked_data[i] = data[payloadSent + i] ^ maskKey[(payloadSent + i) % 4];
        }
        const size_t added = client->add((const char *)masked_data, chunk, ASYNC_WRITE_FLAG_COPY | ((chunk == remaining) ? 0 : ASYNC_WRITE_FLAG_MORE));
        committed += added;
        if (added < chunk) {
          break;  // out of space (or partial commit) -- resume here next time
        }
        payloadSent += added;
        remaining -= added;
      }
    } else {
      committed += client->add((const char *)(data + payloadSent), remaining, ASYNC_WRITE_FLAG_COPY);
    }
  }

  return committed;
}

/*
 *    AsyncWebSocketMessageBuffer
 */

AsyncWebSocketMessageBuffer::AsyncWebSocketMessageBuffer(const uint8_t *data, size_t size) : _buffer(std::make_shared<std::vector<uint8_t>>(size)) {
  if (_buffer->capacity() < size) {
    _buffer->reserve(size);
  } else {
    std::memcpy(_buffer->data(), data, size);
  }
}

AsyncWebSocketMessageBuffer::AsyncWebSocketMessageBuffer(size_t size) : _buffer(std::make_shared<std::vector<uint8_t>>(size)) {
  if (_buffer->capacity() < size) {
    _buffer->reserve(size);
  }
}

bool AsyncWebSocketMessageBuffer::reserve(size_t size) {
  if (_buffer->capacity() >= size) {
    return true;
  }
  _buffer->reserve(size);
  return _buffer->capacity() >= size;
}

/*
 * Async WebSocket Client
 */
const char *AWSC_PING_PAYLOAD = "ESPAsyncWebServer-PING";
const size_t AWSC_PING_PAYLOAD_LEN = 22;

AsyncWebSocketClient::AsyncWebSocketClient(AsyncClient *client, AsyncWebSocket *server)
  : _client(client), _server(server), _clientId(_server->_getNextId()), _status(WS_CONNECTED), _lastMessageTime(millis()), _keepAlivePeriod(0),
    _pstate(AwsParseState::Start), _tempObject(NULL) {

  _client->setRxTimeout(0);
  _client->onError(
    [](void *r, AsyncClient *c, int8_t error) {
      (void)c;
      ((AsyncWebSocketClient *)(r))->_onError(error);
    },
    this
  );
  _client->onAck(
    [](void *r, AsyncClient *c, size_t len, uint32_t time) {
      (void)c;
      ((AsyncWebSocketClient *)(r))->_onAck(len, time);
    },
    this
  );
  _client->onDisconnect(
    [](void *r, AsyncClient *c) {
      ((AsyncWebSocketClient *)(r))->_onDisconnect();
      delete c;
    },
    this
  );
  _client->onTimeout(
    [](void *r, AsyncClient *c, uint32_t time) {
      (void)c;
      ((AsyncWebSocketClient *)(r))->_onTimeout(time);
    },
    this
  );
  _client->onData(
    [](void *r, AsyncClient *c, void *buf, size_t len) {
      (void)c;
      ((AsyncWebSocketClient *)(r))->_onData(buf, len);
    },
    this
  );
  _client->onPoll(
    [](void *r, AsyncClient *c) {
      (void)c;
      ((AsyncWebSocketClient *)(r))->_onPoll();
    },
    this
  );
  memset(&_pinfo, 0, sizeof(_pinfo));
}

AsyncWebSocketClient::~AsyncWebSocketClient() {
  {
    asyncsrv::lock_guard_type lock(_queue_lock);
    _messageQueue.clear();
    _controlQueue.clear();
  }
  _server->_handleEvent(this, WS_EVT_DISCONNECT, NULL, NULL, 0);
}

void AsyncWebSocketClient::_onAck(size_t len, uint32_t time) {
  (void)time;
  _lastMessageTime = millis();

  asyncsrv::unique_lock_type lock(_queue_lock);

  async_ws_log_v("[%s][%" PRIu32 "] ACK(%u)", _server->url(), _clientId, len);

