ESP32Async/ESPAsyncWebServer/src/AsyncWebSocket.cpp
    return false;
  }

  _messageQueue.emplace_back(buffer, opcode, mask);
  async_ws_log_v("[%s][%" PRIu32 "] QUEUE MSG (%u/%u) << %" PRIu8, _server->url(), _clientId, _messageQueue.size(), WS_MAX_QUEUED_MESSAGES, opcode);

  if (_client && _client->canSend()) {
    _runQueue(lock);
  }

  return true;
}

void AsyncWebSocketClient::close(uint16_t code, const char *message) {
  if (_status != WS_CONNECTED) {
    return;
  }

  async_ws_log_w("[%s][%" PRIu32 "] CLOSE", _server->url(), _clientId);

  _status = WS_DISCONNECTING;

  if (code) {
    uint8_t packetLen = 2;
    if (message != NULL) {
      size_t mlen = strlen(message);
      if (mlen > 123) {
        mlen = 123;
      }
      packetLen += mlen;
    }
    char *buf = (char *)malloc(packetLen);
    if (buf != NULL) {
      buf[0] = (uint8_t)(code >> 8);
      buf[1] = (uint8_t)(code & 0xFF);
      if (message != NULL) {
        memcpy(buf + 2, message, packetLen - 2);
      }
      _queueControl(WS_DISCONNECT, (uint8_t *)buf, packetLen);
      free(buf);
      return;
    } else {
      async_ws_log_e("Failed to allocate");
      // Reads _client, then dereference it without any lock.
      // A concurrent _onDisconnect could null + delete the client between the check and the use.
      // Local capture ensures the pointer is read exactly once, eliminating the null-dereference.
      // (TOCTOU)
      AsyncClient *c = _client;
      if (c) {
        c->abort();
      }
      return;
    }
  }
  _queueControl(WS_DISCONNECT);
}

bool AsyncWebSocketClient::ping(const uint8_t *data, size_t len) {
  return _status == WS_CONNECTED && _queueControl(WS_PING, data, len);
}

void AsyncWebSocketClient::_onError(int8_t err) {
  async_ws_log_v("[%s][%" PRIu32 "] ERROR %" PRIi8, _server->url(), _clientId, static_cast<int8_t>(err));
}

void AsyncWebSocketClient::_onTimeout(uint32_t time) {
  // Reads _client, then dereference it without any lock.
  // A concurrent _onDisconnect could null + delete the client between the check and the use.
  // Local capture ensures the pointer is read exactly once, eliminating the null-dereference.
  // (TOCTOU)
  AsyncClient *c = _client;
  if (!c) {
    return;
  }
  async_ws_log_v("[%s][%" PRIu32 "] TIMEOUT %" PRIu32, _server->url(), _clientId, time);
  c->close();
}

void AsyncWebSocketClient::_onDisconnect() {
  async_ws_log_v("[%s][%" PRIu32 "] DISCONNECT", _server->url(), _clientId);
  _status = WS_DISCONNECTED;
  {
    // Every queue method (_queueControl, _queueMessage, _runQueue, _onPoll, _onAck) reads _client while holding _queue_lock.
    // For those guarded reads to be meaningful, the write must also be synchronized. This doesn't change _queue_lock's purpose — it still guards queue integrity — but ensures the "is client alive?" checks that protect queue operations see a consistent value.
    asyncsrv::lock_guard_type lock(_queue_lock);
    _client = nullptr;
  }
  _server->_handleDisconnect(this);
}

void AsyncWebSocketClient::_onData(void *pbuf, size_t plen) {
  _lastMessageTime = millis();
  uint8_t *data = (uint8_t *)pbuf;

  while (plen > 0) {
    async_ws_log_v(
      "[%s][%" PRIu32 "] DATA plen: %" PRIu32 ", _pstate: %" PRIu8 ", _status: %" PRIu8, _server->url(), _clientId, static_cast<uint32_t>(plen),
      static_cast<uint8_t>(_pstate), static_cast<uint8_t>(_status)
    );

    bool consume_byte = true;

    switch (_pstate) {
      case AwsParseState::Start:
        // First header byte
        _pinfo.index = 0;
        _pinfo.final = (data[0] & 0x80) != 0;
        _pinfo.opcode = data[0] & 0x0F;
        _pstate = AwsParseState::Length;
        break;
      case AwsParseState::Length:
        // Second header byte
        _pinfo.masked = ((data[0] & 0x80) != 0) ? 1 : 0;
        _pinfo.len = data[0] & 0x7F;
        // Select length type
        if (_pinfo.len == 126) {
          _pstate = AwsParseState::Length2_1;
        } else if (_pinfo.len == 127) {
          _pstate = AwsParseState::Length8_1;
        } else {
          _pstate = (_pinfo.masked) ? AwsParseState::Mask_0 : AwsParseState::Payload;
        }
        break;

      // 2-byte length form
      case AwsParseState::Length2_1:
        _pinfo.len = (data[0] << 8);
        _pstate = AwsParseState::Length2_2;
        break;
      case AwsParseState::Length2_2:
        _pinfo.len += data[0];
        _pstate = (_pinfo.masked) ? AwsParseState::Mask_0 : AwsParseState::Payload;
        break;

      // 8-byte length form, tediously unrolled
      case AwsParseState::Length8_1:
        _pinfo.len = (uint64_t)data[0] << 56;
        _pstate = AwsParseState::Length8_2;
        break;
      case AwsParseState::Length8_2:
        _pinfo.len += (uint64_t)data[0] << 48;
        _pstate = AwsParseState::Length8_3;
        break;
      case AwsParseState::Length8_3:
        _pinfo.len += (uint64_t)data[0] << 40;
        _pstate = AwsParseState::Length8_4;
        break;
      case AwsParseState::Length8_4:
        _pinfo.len += (uint64_t)data[0] << 32;
        _pstate = AwsParseState::Length8_5;
        break;
      case AwsParseState::Length8_5:
        _pinfo.len += (uint64_t)data[0] << 24;
        _pstate = AwsParseState::Length8_6;
        break;
      case AwsParseState::Length8_6:
        _pinfo.len += (uint64_t)data[0] << 16;
        _pstate = AwsParseState::Length8_7;
        break;
      case AwsParseState::Length8_7:
        _pinfo.len += (uint64_t)data[0] << 8;
        _pstate = AwsParseState::Length8_8;
        break;
      case AwsParseState::Length8_8:
        _pinfo.len += (uint64_t)data[0];
        _pstate = (_pinfo.masked) ? AwsParseState::Mask_0 : AwsParseState::Payload;
        break;

      // Mask bytes
      case AwsParseState::Mask_0:
        _pinfo.mask[0] = data[0];
        _pstate = AwsParseState::Mask_1;
        break;
      case AwsParseState::Mask_1:
        _pinfo.mask[1] = data[0];
        _pstate = AwsParseState::Mask_2;
        break;
      case AwsParseState::Mask_2:
        _pinfo.mask[2] = data[0];
        _pstate = AwsParseState::Mask_3;
        break;
      case AwsParseState::Mask_3:
        _pinfo.mask[3] = data[0];
        _pstate = AwsParseState::Payload;
        break;

      // And finally, payload processing
      case AwsParseState::Payload:
      {
        async_ws_log_v(
          "[%s][%" PRIu32 "] DATA _pinfo: index: %" PRIu64 ", final: %" PRIu8 ", opcode: %" PRIu8 ", masked: %" PRIu8 ", len: %" PRIu64, _server->url(),
          _clientId, _pinfo.index, _pinfo.final, _pinfo.opcode, _pinfo.masked, _pinfo.len
        );
        const size_t datalen = std::min((size_t)(_pinfo.len - _pinfo.index), plen);
        if (!_handleClientFrame(data, datalen, datalen == plen)) {  // datalen == plen means that we are processing the last part of the current TCP packet
          return;                                                   // client is now destroyed, so we must return immediately to avoid accessing any member
        }
        consume_byte = false;
        data += datalen;
        plen -= datalen;
        if (_pinfo.index >= _pinfo.len) {
          _pstate = AwsParseState::Start;
        }
        break;
      }
    }  // end switch over _pstate

    if (consume_byte) {
      // Advance the buffer by one byte.  Centralized to save copy-and-paste in so many states.
      data += 1;
      plen -= 1;
    }
  }  // end while(plen > 0)

  // data completely consumed
  if ((_pinfo.opcode == WS_DISCONNECT) && (_pstate == AwsParseState::Mask_0) && (_pinfo.len == 0)) {
    // Safari close frame edge case: masked bit set but no mask data
    async_ws_log_v("[%s][%" PRIu32 "] DATA close frame with incomplete mask, treating as unmasked", _server->url(), _clientId);
    _pinfo.masked = 0;
    _pstate = AwsParseState::Payload;
  }

  // A zero-length frame could be at the end of the packet; dispatch it now.
  if ((_pstate == AwsParseState::Payload) && (_pinfo.len == 0)) {
    if (!_handleClientFrame(data, 0, true)) {
      return;
    }
    _pstate = AwsParseState::Start;
  }
}

bool AsyncWebSocketClient::_handleClientFrame(uint8_t *data, size_t datalen, bool last) {
  // Process a frame from the client.  Header information is stored in _pinfo.
  // Returns true on successful handling, false on error.

  if (_pinfo.masked) {
    for (size_t i = 0; i < datalen; i++) {
      data[i] ^= _pinfo.mask[(_pinfo.index + i) % 4];
    }
  }

  if (_pinfo.index == 0) {  // first fragment of the frame
    // init message_opcode for this frame
    // note: For next WS_CONTINUATION frames, they have opcode 0, so message_opcode will stay like the first frame
    if (_pinfo.opcode == WS_TEXT || _pinfo.opcode == WS_BINARY) {
      _pinfo.message_opcode = _pinfo.opcode;
    }
    // init frame number to 0 if only 1 frame or if this is the first frame of a fragmented message
    if (_pinfo.final || datalen < _pinfo.len) {
      _pinfo.num = 0;
    }
  }

  if ((datalen + _pinfo.index) < _pinfo.len) {  // more fragments to read for this frame
    if (datalen > 0) {
      async_ws_log_v(
        "[%s][%" PRIu32 "] DATA processing next fragment of %s frame %" PRIu32 ", index: %" PRIu64 ", len: %" PRIu32 "", _server->url(), _clientId,
        (_pinfo.message_opcode == WS_TEXT) ? "text" : "binary", _pinfo.num, _pinfo.index, (uint32_t)datalen
      );
      if (!_handleDataEvent(data, datalen, last)) {
        return false;  // stop processing on failure
      }
    }

    // track index for next fragment
    _pinfo.index += datalen;
  } else if ((datalen + _pinfo.index) == _pinfo.len) {  // this is the last fragment for this frame
    if (_pinfo.opcode == WS_DISCONNECT) {
      async_ws_log_v("[%s][%" PRIu32 "] DATA WS_DISCONNECT", _server->url(), _clientId);

