ESP32Async/ESPAsyncWebServer/src/AsyncWebSocket.cpp
      if (datalen) {
        uint16_t reasonCode = (uint16_t)(data[0] << 8) + data[1];
        char *reasonString = (char *)(data + 2);
        if (reasonCode > 1001) {
          _server->_handleEvent(this, WS_EVT_ERROR, (void *)&reasonCode, (uint8_t *)reasonString, strlen(reasonString));
        }
      }
      if (_status == WS_DISCONNECTING) {
        _status = WS_DISCONNECTED;
        if (_client) {
          _client->close();
        }
        return false;  // our object is now destroyed, so we must return immediately to avoid accessing any member
      } else {
        _status = WS_DISCONNECTING;
        if (_client) {
          _client->ackLater();
        }
        _queueControl(WS_DISCONNECT, data, datalen);
      }

    } else if (_pinfo.opcode == WS_PING) {
      async_ws_log_v("[%s][%" PRIu32 "] DATA PING", _server->url(), _clientId);
      _server->_handleEvent(this, WS_EVT_PING, NULL, NULL, 0);
      _queueControl(WS_PONG, data, datalen);

    } else if (_pinfo.opcode == WS_PONG) {
      async_ws_log_v("[%s][%" PRIu32 "] DATA PONG", _server->url(), _clientId);
      if (datalen != AWSC_PING_PAYLOAD_LEN || memcmp(AWSC_PING_PAYLOAD, data, AWSC_PING_PAYLOAD_LEN) != 0) {
        _server->_handleEvent(this, WS_EVT_PONG, NULL, data, datalen);
      }
    } else if (_pinfo.opcode < WS_DISCONNECT) {  // continuation or text/binary frame
      async_ws_log_v(
        "[%s][%" PRIu32 "] DATA processing final fragment of %s frame %" PRIu32 ", index: %" PRIu64 ", len: %" PRIu32 "", _server->url(), _clientId,
        (_pinfo.message_opcode == WS_TEXT) ? "text" : "binary", _pinfo.num, _pinfo.index, (uint32_t)datalen
      );

      if (!_handleDataEvent(data, datalen, last)) {
        return false;  // stop processing on failure
      }

      if (_pinfo.final) {
        _pinfo.num = 0;
      } else {
        _pinfo.num += 1;
      }
    }

    _pinfo.index = _pinfo.len;  // mark packet as complete
  } else {
    // unexpected frame protocol error - how is this possible?
    async_ws_log_v(
      "[%s][%" PRIu32 "] DATA frame error: len: %u, index: %" PRIu64 ", total: %" PRIu64 "\n", _server->url(), _clientId, datalen, _pinfo.index, _pinfo.len
    );

    _status = WS_DISCONNECTING;
    if (_client) {
      _client->ackLater();
    }
    _queueControl(WS_DISCONNECT, data, datalen);
  }

  return true;
}

bool AsyncWebSocketClient::_handleDataEvent(uint8_t *data, size_t len, bool endOfPaquet) {
  // ------------------------------------------------------------
  // Issue 384: https://github.com/ESP32Async/ESPAsyncWebServer/issues/384
  // Discussion: https://github.com/ESP32Async/ESPAsyncWebServer/pull/383#discussion_r2760425739
  // The initial design of the library was doing a backup of the byte following the data buffer because the client code
  // was allowed and documented to do something like data[len] = 0; to facilitate null-terminated string handling.
  // This was a bit hacky but it was working and it was documented, although completely incorrect because it was modifying a byte outside of the data buffer.
  // So to fix this behavior and to avoid breaking existing client code that may be relying on this behavior, we now have to copy the data to a temporary buffer that has an extra byte for the null terminator.
  // ------------------------------------------------------------
  //
  // Optimization notes:
  //
  // 1) opcodes
  //
  // - info->opcode stores the current WS frame type (binary, text, continuation)
  // - info->message_opcode stores the WS frame type of the first frame of the message, which is used for fragmented messages to know the message type when processing subsequent frame with opcode 0 (continuation)
  // So we can use info->message_opcode to avoid copying the data for non-text frames, and only copy the data for text frames when we need to add a null terminator for client code convenience.
  //
  // 2) data copy vs data backup/restore
  // - endOfPaquet: is true when datalen == plen. plen is the remaining bytes in the current TCP packet, so if datalen == plen, it means that we are processing the last part of the current TCP packet.
  // In that case, we have to copy since we cannot backup/restore the byte after the data buffer.
  // Otherwise we can backup the byte and restore since we know that the byte after is owned by the current TCP packet (same pointer).
  if (_pinfo.message_opcode == WS_TEXT) {
    if (endOfPaquet) {
      std::unique_ptr<uint8_t[]> copy(new (std::nothrow) uint8_t[len + 1]());
      if (copy) {
        memcpy(copy.get(), data, len);
        copy[len] = 0;
        _server->_handleEvent(this, WS_EVT_DATA, (void *)&_pinfo, copy.get(), len);
      } else {
        async_ws_log_e("Failed to allocate");
        AsyncClient *c = _client;
        if (c) {
          c->abort();
        }
        return false;  // failure!
      }
    } else {
      uint8_t backup = data[len];
      data[len] = 0;
      _server->_handleEvent(this, WS_EVT_DATA, (void *)&_pinfo, data, len);
      data[len] = backup;
    }
  } else {
    _server->_handleEvent(this, WS_EVT_DATA, (void *)&_pinfo, data, len);
  }
  return true;
}

size_t AsyncWebSocketClient::printf(const char *format, ...) {
  va_list arg;
  va_start(arg, format);
  size_t len = vsnprintf(nullptr, 0, format, arg);
  va_end(arg);

  if (len == 0) {
    return 0;
  }

  char *buffer = new char[len + 1];

  if (!buffer) {
    return 0;
  }

  va_start(arg, format);
  len = vsnprintf(buffer, len + 1, format, arg);
  va_end(arg);

  bool enqueued = text(buffer, len);
  delete[] buffer;
  return enqueued ? len : 0;
}

#ifdef ESP8266
size_t AsyncWebSocketClient::printf_P(PGM_P formatP, ...) {
  va_list arg;
  va_start(arg, formatP);
  size_t len = vsnprintf_P(nullptr, 0, formatP, arg);
  va_end(arg);

  if (len == 0) {
    return 0;
  }

  char *buffer = new char[len + 1];

  if (!buffer) {
    return 0;
  }

  va_start(arg, formatP);
  len = vsnprintf_P(buffer, len + 1, formatP, arg);
  va_end(arg);

  bool enqueued = text(buffer, len);
  delete[] buffer;
  return enqueued ? len : 0;
}
#endif

bool AsyncWebSocketClient::text(AsyncWebSocketMessageBuffer *buffer) {
  bool enqueued = false;
  if (buffer) {
    enqueued = text(std::move(buffer->_buffer));
    delete buffer;
  }
  return enqueued;
}

